Repository: CodeForAfrica/HURUmap-apps
Catalog: elimu_yangu/leaguetable/locale/*/LC_MESSAGES/django.po
Languages: sw

source: 10 Top Schools
sw: Shule 10 Bora

source: Schools Category with 40 Students and More
sw: Kundi la Shule zenye ya wanafunzi 40 na zaidi

source: in
sw: katika

source: 10 Lowest Schools
sw: Shule 10 za Mwisho

source: Schools Category with less than 40 Students
sw: Kundi la Shule zenye ya wanafunzi chini ya 40

source: Schools Category less than 40 Students
sw: Kundi la Shule zenye ya wanafunzi chini ya 40

source: Discover The Stories Behind The Data
sw: Vumbua undani wa Takwimu

source: School League helps storytellers and campaigners use data to add context and depth to stories.
sw: School League inasawasaidia waandishi wa habari na wanaharakati kutumia takwimu/taarifakwenye habari zao

source: SCHOOL RANKINGS
sw: MATOKEO YA SHULE

source: Boys
sw: Wavulana

source: Mixed
sw: Mchanganyiko

source: Girls
sw: Wasichana

source: Interact with charts and statistics for additional information.
sw: Fanya utafiti wa chati na takwimu ili kupata taarifa zaidi

source: Ownership
sw: Umiliki

source: Regions
sw: Mikoa

source: Averege GPA
sw: Wastani wa GPA

source: Boys School
sw: Shule ya Wavulana

source: Mixed School
sw: Shule ya Mchanganyiko

source: Girls School
sw: Shule ya Wasichana

source: In
sw: wilayani

source: SCHOOL RANKING
sw: MATOKEO YA SHULE
