Repository: CodeForAfrica/HURUmap-apps
Catalog: elimu_yangu/careerguide/locale/*/LC_MESSAGES/django.po
Languages: sw

source: ACCOUNTANT
sw: MHASIBU

source: ARCHITECT
sw: UWANDISHI WA MAJENGO

source: AUDITOR
sw: UKAGUZI

source: COMPUTER SCIENTIST/ENGINEER
sw: MASOMO YA KOMPYUTA

source: MEDECINE
sw: UDAKTARI NA MADAWA

source: ECONOMIST
sw: UCHUMI

source: ENGINEERING
sw: UHANDISI

source: FINANCIAL ANALYST
sw: UCHAMBUZI WA FEDHA/HAZINA

source: SCIENCE TEACHER
sw: UWALIMU WA SAYANSI

source: TEACHER
sw: UWALIMU

source: PILOT
sw: RUBANI

source: LAWYER
sw: MWANASHERIA

source: select gender
sw: chagua jinsia

source: young lady
sw: msichana

source: young man
sw: mvulana

source: select region
sw: chagua mkoa

source: choose a career
sw: chagua taaluma

source: an accountant
sw: mhasibu

source: an architect
sw: mwandishi wa majengo

source: an auditor
sw: mkaguzi

source: a computer scientist/engineer
sw: msanifu wa kompyuta

source: a doctor
sw: daktari

source: an economist
sw: mwanauchumi

source: a pilot
sw: rubani

source: an engineer
sw: mhandisi

source: choose study level
sw: chagua ngazi ya elimu yako

source: ordinary level
sw: shule ya sekondari

source: primary level
sw: shule ya msingi

source: FIND THE BEST HIGHSCHOOL FOR YOUR CAREER
sw: TAFUTA SHULE BORA YA TAALUMA YAKO

source: I am a
sw: Mimi ni

source: from
sw: kutoka

source: currently at
sw: hivi sasa nipo

source: and I want to be
sw: na nitaka kuwa

source: FIND
sw: TAFUTA

source: TO STUDY
sw: KUSOMA

source: YOU NEED A PASS IN THE FOLLOWING SUBJECTS:
sw: INABIDI UFAULU MASOMO HAYA:

source: AND A SATISFACTORY PASS IN:
sw: NA UFANYE VIZURI KWENYE:

source: AND A PASS IN AT LEAST 2 OF THE FOLLOWING SUBJECTS:
sw: NA UFAULU ANGALAU MASOMO MAWILI KATI YA HAYA

source: List of Schools doing well in %(school_level)s subjects aligning to your career
sw: Shule zinavyofanya vizuri katika masomo ya %(school_level)s yanayoendana na taaluma utakayo

source: Name of School
sw: Jina la Shule

source: Category
sw: Kundi

source: Region
sw: Mkoa

source: Average GPA
sw: Wastani wa GPA

source: National Ranking
sw: Nafasi ya Kitaifa

source: Regional Ranking
sw: Nafasi ya Kimkoa

source: Centre With 30 Candidates or More
sw: Kituo Chenye Wanafunzi 30 na Zaidi

source: Centre With less than 30 Candidates
sw: Kituo Chenye Watahaniwa chini ya 30

source: Centre With 40 Candidates or More
sw: Kituo Chenye Watahiniwa 40 na Zaidi

source: Centre With less than 40 Candidates
sw: Kituo Chenye Wanafunzi chini ya 40

source: Overall best performing schools for Ordinary Level 2017
sw: Shule bora kwa ujumla za O-level mwaka 2017

source: Overall best performing schools for Advance Level 2017
sw: Shule bora kwa ujumla za A-level mwaka 2017

source: in
sw: katika

source: Click on A Subject In The Bar Chart To View More Details
sw: Bonyeza kwenye somo upata taarifa zaidi

source: Subject Perfomance
sw: Matokea ya Masomo

source: Regional Rank:
sw: Nafasi ya Kimkoa

source: National Rank:
sw: Nafasi ya Kitaifa

source: Overall Performance
sw: Matokeo kwa Ujumla
