Repository: CodeForAfrica/HURUmap-apps
Catalog: elimu_yangu/universityfinder/locale/*/LC_MESSAGES/django.po
Languages: sw

source: FILL IN YOUR SUBJECTS AND GRADES
sw: JAZA MASOMO NA DARAJA YAKO

source: Fill in Subjects
sw: Jaza Masomo yako

source: Set Preferred Courses
sw: Chagua Kozi utakayo

source: View Course Options
sw: Angalia Kozi

source: Add Subject
sw: Ongeza Somo

source: Name:
sw: Jina

source: Grade
sw: Daraja

source: Save
sw: Tunza

source: Close
sw: Funga

source: Add Course
sw: Ongeza Kozi

source: PREFFERED COURSES
sw: KOZI UTAKAZO

source: Name of Course
sw: Jina la Kozi

source: University
sw: Jina la Chuo
