Repository: CodeForAfrica/HURUmap-apps
Catalog: elimu_yangu/locale/*/LC_MESSAGES/django.po
Languages: sw

source: Swahili
sw: Kiswahili

source: English
sw: Kingereza

source: contains three different tools: School league, Career guide and University finder.
sw: ina jumuisha programu tatu tofauti: School league, Career guide na University finder.

source: Career Guide assists student to find schools to go in any location that align best with their career choice
sw: Career Guide inawasaidia wanafunzi kutafuta shule katika maeneo yao au maeneo mengine zinazo fanya vizuri kwenye

source: The school league tool is built on
sw: School League imetengenezwa juu ya

source: an open source platform by
sw: programu huria

source: and
sw: na

source: for making census data more understandable.
sw: ili kufanya taarifa za sensa kueleweka zaidi

source: Other Projects
sw: Miradi Mingine

source: Join our community
sw: Ungana nasi kwenye

source: MAP OUT YOUR EDUCATION
sw: PANGA ELIMU YAKO

source: A smarter way to plan and search for the right schools and universities
sw: Njia bora ya kupanga na kutafuta shule na vyuo bora

source: I am a
sw: Mimi ni

source: journalist
sw: mwandishi wa habari

source: student
sw: mwanafunzi

source: looking for
sw: ninatafuta

source: suitable university courses to attend
sw: kozi za chuo zitakazo nifaa

source: data on high schools
sw: taarifa za shule

source: best high school to go to
sw: shule bora ya kwenda

source: in the country
sw: nchini

source: Explore the complete list of schools in Tanzania and compare performances within the different regions.
sw: Fanya utafiti kwenye oradha ya shule nchini Tanzania na linganisha matokea kati ya mikoa na wilaya

source: Find schools for you to go in your location that align best with your career choice.
sw: Tafuta shule ya kwenda kwenye eneo lako au lingine inayofanya vizuri kwenye masomo yanayoanisha na taaluma yako

source: Find the best possible university course to attend based on your performance and preferences.
sw: Tafuta kozi bora ya chuo unayoweza kufanya kutokana na matekeo yako ya shule

source: WHAT THEY SAY ABOUT US
sw: WANACHOSEMA KUHUSU SISI

source: On
sw: Juu ya
